---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayBackground.ImagePath
source: html/f617bfcd-a9ac-d4a9-8b8b-e167618d1c83.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground.ImagePath Property

The path to the image file when the type is 'Image'.

## Syntax (C#)
```csharp
public string ImagePath { get; }
```